# Copyright (C) 2016 Colin Fulton
# All rights reserved.
#
# This software may be modified and distributed under the
# terms of the three-clause BSD license. See LICENSE.txt

PLAY =
->(λ) {
->(b) {
->(c) {
->(d) {
->(e) {
->(f) {
->(g) {
->(h) {
->(i) {
->(j) {
->(k) {
->(l) {
->(m) {
->(n) {
->(o) {
->(p) {
->(q) {
->(r) {
->(s) {
->(t) {
->(u) {
->(v) {
->(w) {
->(x) {
->(y) {
->(z) {
->(α) {
->(β) {
->(γ) {
->(δ) {
->(ε) {
->(ζ) {
->(η) {
->(θ) {
->(ι) {
->(κ) {
->(μ) {
->(ν) {
->(ξ) {
->(ο) {
->(π) {
->(ρ) {
->(ς) {
->(σ) {
->(τ) {
->(υ) {
->(φ) {
->(χ) {
->(ψ) {
->(ω) {
->(а) {
->(б) {
->(в) {
->(г) {
->(д) {
->(е) {
->(ж) {
->(з) {
->(и) {
->(й) {
->(к) {
->(л) {
->(м) {
->(н) {
->(о) {
->(п) {
->(р) {
->(с) {
->(т) {
->(у) {
->(ф){
->(х) {
->(♟) {
->(♞) {
->(♚) {
->(♝) {
->(♜) {
->(♛) {
->(ч) {
->(a) {
->(ш) {


->(h) { ->(q) { ->(s) { ->(t) { ->(u) { ->(z) {
  λ[ν[и[а[h]][ψ[h]]]][
    -> { s[h] }][
    -> {
      a[h][
        ->(p) {
          ->(l) {
            λ[n[l]][
              -> {
                ->(k) {
                  λ[
                    ->(j) {
                      ->(e) {
                        λ[
                          м[
                            e][
                            л[j][->(_) { g }]][
                            ->(b) { ->(c) { ->(d) {
                              λ[b][
                                -> { g }][
                                -> {
                                  п[
                                    ♚[ч][
                                      д[c][d][c][d][j][l][r]
                                    ]
                                  ]
                                }
                              ]
                            }}}][
                            f
                          ]
                        ][
                          -> { g }][
                          -> {
                            р[j][σ[e]][ч]
                          }
                        ]
                      }[
                        л[
                          j][
                          ->(λ) {
                            e[
                              μ[λ]][
                              ι[λ][γ]
                            ]
                          }
                        ]
                      ]
                    }[
                      а[k]
                    ]
                  ][
                    -> { q[k] }][
                    -> { t[k] }
                  ]
                }[
                  ->(λ) {
                    д[
                      ψ[λ]][
                      ω[λ]][
                      ψ[h]][
                      ω[h]][
                      а[λ]][
                      г[λ]][
                      в[λ]
                    ]
                  }[m[l]]
                ]
              }][
              -> { u[p] }
            ]
          }[
            ->(b) {
              λ[n[b]][
                -> {
                  a[у[m[b]][p]][
                    ->(λ) { o[g][λ] }][
                    -> { o[f][ l] }
                  ]
                }][
                -> { b }
              ]
            }[
              ->(e) {
                λ[w[m[e]]][
                  -> { o[f][l] }][
                  -> {
                    ->(b) {
                      o[
                        g][
                        θ[
                          n[b]][
                          m[
                            z[
                              ->(λ) {
                                x[n[λ]][m[b]][
                                  o[
                                    v[n[λ]][m[b]]][
                                    l
                                  ]][
                                  o[
                                    n[λ]][
                                    n[λ]
                                  ]
                                ]
                              }][
                              o[z][l]
                            ]
                          ]
                        ]
                      ]
                    }[
                      τ[
                        e][
                        ->(b) { ->(c) {
                          λ[w[m[b]]][
                            -> { ς[b][c] }][
                            -> {
                              y[г[c]][г[σ[b]]][
                                ς[b][c]][
                                x[
                                  г[c]][
                                  г[σ[b]]
                                ][
                                  ς[ρ][c]][
                                  b
                                ]
                              ]
                            }
                          ]
                        }}][
                        ρ
                      ]
                    ]
                  }
                ]
              }[
                τ[
                  ш[
                    p][
                    g][
                    л[
                      а[p]][
                      ->(λ) { c[ν[λ]] }
                    ]
                  ]][
                  ->(c) { ->(d) {
                    ς[
                      c][
                      τ[
                        ш[
                          d][
                          f][
                          ς[ρ][ω[d]]
                        ]][
                        ->(λ) { ->(b) {
                          x[г[b]][г[λ]][
                            λ][
                            у[λ][b]
                          ]
                        }}][
                        d
                      ]
                    ]
                  }}][
                  ρ
                ]
              ]
            ]
          ]
        }][
        -> { s[h] }
      ]
    }
  ]
}}}}}}









}[
  # "possible_moves"
  # "ш"
  ->(λ) { ->(b) { ->(c) {
    ->(d) {
      м[
        л[d][b[ν][μ]]][
        c][
        ->(e) { ->(f) { ->(g) {
          a[
            д[
              f][
              g][
              б[λ]][
              χ[λ]][
              d][
              l][
              b[s][r]
            ]
          ][
            ->(λ) { ς[e][λ] }][
            -> { e }
          ]
        }}}][
        ρ
      ]
    }[
      а[λ]
    ]
  }}}
]



}[
  # "λdvλnce_stλte"
  # "a"
  ->(b) {
    ->(t) {
      ->(c) {->(d) {
        λ[п[t]][
          -> {
            c[
              ->(d) {
                д[
                  ψ[b]][
                  ω[b]][
                  ψ[b]][
                  ω[b]][
                  d][
                  ->(e) {
                    ж[
                      d][
                      ->(f) { ->(g) { ->(h) {
                        p[
                          ν[g][
                            p][
                            v
                          ][
                            f][
                            ζ[g]
                          ]][
                          λ[μ[g]][
                            -> {
                              λ[ι[g][γ]][
                                -> {
                                  п[
                                    ч[и[d][e]][
                                      д[
                                        e][
                                        h][
                                        e][
                                        e][
                                        d][
                                        l][
                                        s
                                      ]
                                    ]
                                  ][
                                    z[α][q]][
                                    l
                                  ]
                                }][
                                -> { l }
                              ]
                            }][
                            -> { l }
                          ]
                        ]
                      }}}][
                      z[α][q]
                    ]
                  }[ω[b]]][
                  в[b]
                ]
              }[
                t[
                  т][
                  l][
                  ->(λ) { ->(b) { ->(c) { ->(d) {
                    ->(e) {
                      с[
                        т[λ][b][c][d]][
                        e][
                        e][
                        φ
                      ]
                    }[
                      o[n[c]][m[b]]
                    ]
                  }}}}][
                  ->(d) { ->(λ) { ->(b) { ->(c) {
                    ->(e) {
                      т[
                        т[d][ λ][ b][ c]][
                        o[e[l][β]][m[λ]]][
                        o[e[i][q]][m[λ]]][
                        c
                      ]
                    }[
                      x[n[λ]][n[b]]
                    ]
                  }}}}][
                  с
                ][
                  а[b]][
                  ψ[b]][
                  ω[b]][
                  в[b]
                ]
              ]
            ]
          }][
          -> { d[] }
        ]
      }}
    }[
      # "move_type"
      ч[и[а[b]][ψ[b]]][b]
    ]
  }
]



}[
  # "get_rule"
  # "ч"
  ->(λ) { λ[λ] }[ ->(b) {
    ->(c) {
      ι[c][k][
        ♟][
      ι[c][->(λ) { ->(b) { λ[λ[λ[λ[b]]]] } }][
        ♜][
      ι[c][j][
        ♞][
      ι[c][i][
        ♝][
      ι[c][q][
        ♛][
      ι[c][γ][
        ♚][
        ->(_) { ->(_) { н } }
      ]]]]]][->(c) { b[b][c] }]
    } } ]
]



}[
  # "queen_rule"
  # "♛"
  ->(λ) {
    ->(b) {
      ->(c) {
        d[
          c[♜[λ]]][
          c[♝[λ]]
        ][
          о][
          н
        ]
      }[
        ->(λ) { п[λ[b]] }
      ]
    }
  }
]



}[
  # "rook_rule"
  # "♜"
  х[
    ->(λ) { ->(b) {
      d[
        w[λ]][
        w[b]
      ]
    }}
  ]
]



}[
  # "bishop_rule"
  # "♝"
  х[
    ->(λ) {
      -> (b) {
      y[λ][b]
    }}
  ]
]



}[
  # "king_rule"
  # "♚"
  ф[
    ->(d) { ->(i) {
      λ[
        e[
          x[k][υ[ψ[d]][ω[d]][n]]][
          x[k][υ[ψ[d]][ω[d]][m]]
        ]
      ][
        -> { о }][
        -> {
          е[
            d][
            ->(k) { ->(p) { ->(q) {
              λ[
                e[
                  y[j][υ[p][q][n]]][
                  w[υ[p][q][m]]
                ]
              ][
                -> {
                  ->(r) {
                    ->(s) { ->(t) { ->(v) {
                      λ[
                        ->(λ) { ->(d) {
                          b[
                            ι[λ][γ]][
                            c[δ[λ]]][
                            ι[d][h]][
                            c[δ[d]]][
                            к[k][p][s][u]
                          ]
                        } }[
                          и[k][p]][
                          и[k][s]
                        ]
                      ][
                        -> {
                          λ[р[т[k][p][p][l]][p][i]][
                            -> {
                              λ[р[т[k][p][v][l]][v][i]][
                                -> { g }][
                                t
                              ]
                            }][
                            t
                          ]
                        }][
                        t
                      ]
                    } } }[
                      o[r[l][β]][m[p]]][
                      -> { f }][
                      o[
                        r[u][t][n[p]]][
                        m[p]
                      ]
                    ]
                  }[
                    x[n[p]][n[q]]
                  ]
                }][
                -> { f }
              ]
            }}}
          ][
            ->(_) { ->(_) { ->(_) { ->(cλstle) { ->(_) { cλstle }}}}}][
            н
          ]
        }
      ]
    }}
  ]
]



}[
  # "knight_rule"
  # "♞"
  ф[
    ->(λ) {->(_) {
      ->(b) { -> (c) {
        d[
          e[
            y[j][b]][
            y[k][c]
          ]][
          e[
            y[k][b]][
            y[j][c]
          ]
        ][
          о][
          н
        ]
     } }[
        υ[ψ[λ]][ω[λ]][n]][
        υ[ψ[λ]][ω[λ]][m]
      ]
    }}
  ]
]



}[
  # "pλwn_rule"
  # "♟"
  ф[
    ->(h) {
    ->(_) {
      е[
        h][
        ->(i) { ->(l) { ->(p) {
          ->(z) { ->(q) { ->(r) {
            λ[
               z[
                w[v[q][r]]][
                w[v[r][q]]
              ]
            ][
              -> {
                ->(t) {
                  λ[y[k][t]][
                    -> {
                      ->(u) { ->(v) {
                        λ[w[u]][
                          -> {
                            ξ[и[i][p]][
                              y[
                                r][
                                z[β][l]
                              ][
                                ->(_) { ->(_) { ->(_) { ->(_) { ->(λ) { λ }}}}}][
                                о
                              ]][
                              н
                            ]
                          }][
                          -> {
                            λ[y[k][u]][
                              -> {
                                λ[ξ[и[i][p]]][
                                  -> {
                                    ->(x) {
                                      b[
                                        g][
                                        з[
                                          v][
                                          o[n[p]][q]
                                        ]][
                                        ι[x][k]][
                                        z[μ][ν][x]][
                                        y[
                                          υ[б[h]][v][m]][
                                          j
                                        ]
                                      ][
                                        ->(_) { ->(_) { ->(λ) { ->(_) { ->(_) { λ }}}}}][
                                        н
                                      ]
                                    }[
                                      и[i][v]
                                    ]
                                  }][
                                  -> { о }
                                ]
                              }][
                              -> { н }
                            ]
                          }
                        ]
                      } }[
                        υ[l][p][n]][
                        χ[h]
                      ]
                    }][
                    -> {
                      λ[y[j][t]][
                        -> {
                          λ[w[υ[l][p][n]]][
                            -> {
                              e[
                                ξ[и[i][p]]][
                                e[
                                  ξ[
                                    и[
                                      i][
                                      o[
                                        n[p]][
                                        й[l][ p][ m][q]
                                      ]
                                    ]
                                  ]][
                                  c[δ[и[i][l]]]
                                ]
                              ][
                                о][
                                н
                              ]
                            }][
                            -> { н }
                          ]
                        }][
                        -> { н }
                      ]
                    }
                  ]
                }[
                  υ[l][p][m]
                ]
              }][
              -> { н }
            ]
          }}}[
            ν[и[i][l]]][
            m[l]][
            m[p]
          ]
        }}}
      ]
    }}
  ]
]



}[
  # "strλight_line_rule"
  # "х"
  ->(b) {
    ф[
      ->(c) {
      ->(_) {
        е[
          c][
          ->(d) { ->(e) { ->(f) {
            λ[b[υ[e][f][n]][υ[e][f][m]]][
              -> {
                к[d][e][f][u][
                  о][
                  н
                ]
              }][
              -> { н }
            ]
          }}}
        ]
      }}
    ]
  }
]



}[
  # "bλsic_checks"
  # "ф"
  ->(o) {
    ->(n) {
      ->(m) {
        е[
          m][
          ->(l){->(k){->(j) {
            λ[
              κ[и[l][k]][
                ν[и[l][j]]][
                μ[и[l][j]]][
                f
              ]
            ][
              -> { н }][
              -> {
                ->(i) {
                  λ[п[i]][
                    -> {
                      ->(c) { ->(d) {
                        ->(h) {
                          τ[h][
                            ->(c) { ->(b) {
                              λ[c][
                                -> {
                                  р[
                                    d][
                                    b][
                                    n
                                  ][
                                    g][
                                    f
                                  ]
                                }][
                                -> { f }
                              ]
                            }}][
                            g
                          ]
                        }[
                          л[
                            d][
                            ->(λ) {
                              e[
                                ι[λ][γ]][
                                ν[λ][
                                  ν[c]][
                                  μ[c]
                                ]
                              ]
                            }
                          ]
                        ]
                      } }[
                        и[l][k]][
                        т[l][k][j][l]
                      ][
                        i][
                        н
                      ]
                    }][
                    -> { i }
                  ]
                }[
                  # "move_type"
                  o[m][n]
                ]
              }
            ]
          }}}
        ]
      }
    }
  }
]



}[
  # "updλte_λll_but_from_to_promotion"
  # "у"
  ->(λ) { ->(b) {
    д[
      ψ[λ]][
      ω[λ]][
      ψ[b]][
      ω[b]][
      а[b]][
      г[b]][
      в[λ]
    ]
  }}
]



}[
  # "normλl_move"
  # "т"
  ->(λ) { ->(b) { ->(c) { ->(_) {
    с[λ][b][c][и[λ][b]]
  }}}}
]



}[
  # "chλnge_move"
  # "с"
  ->(b) { ->(c) { ->(d) { ->(e) {
    ο[
      b][
      α][
      ->(w) {
      ->(y) {
        ο[
          w][
          α][
          ->(z) {
          ->(x) {
            λ[з[o[x][y]][d]][
              -> {
                o[
                  o[η[e]][ζ[e]]][
                  o[ε[e]][g]
                ]
              }][
              -> { з[o[x][y]][c][φ][z] }
            ]
          }}
        ]
      }}
    ]
  }}}}
]



}[
  # "is_not_in_check"
  # "р"
  ->(b) { ->(d) { ->(e) {
    м[
      л[
        b][
        ->(λ) {
          ν[и[b][d]][
            μ[λ]][
            ν[λ]
          ]
        }
      ]][
      ς[ρ][ d]][
      ->(g) { ->(h) { ->(d) {
        λ[g][
          -> {
            c[
              п[
                e[и[b][h]][
                  д[h][d][h][d][b][l][l]
                ]
              ]
            ]
          }][
          -> { f }
        ]
      }}}][
      g
    ]
  }}}
]



}[
  # "isnt_invλlid"
  # "п"
  ->(λ) { λ[g][f][g][g][g] }
]



}[
  # "vλlid"
  # "о"
  ->(λ){->(_) { ->(_) { ->(_) { ->(_) { λ } }}}}
]



}[
  # "invλlid"
  # "н"
  ->(_) { ->(λ) { ->(_) { ->(_) { ->(_) { λ } }}}}
]



}[
  # "from_to_reduce"
  # "м"
  ->(λ) { ->(b) { ->(c) { ->(d) {
    τ[
      λ][
      ->(e) { ->(f) {
        τ[
          b][
            ->(g) { ->(h) {
              c[g][f][h]
            }}
          ][
          e
        ]
      }}][
      d
    ]
  }}}}
]



}[
  # "position_select"
  # "л"
  ->(λ) { ->(b) {
    ж[
      λ][
      ->(c) { ->(d) { ->(e) {
        b[d][
          ς[c][e]][
          c
        ]
      }}}][
      ρ
    ]
  }}
]

}[
  # "free_pλth"
  # "к"
  ->(b) { ->(c) { ->(e) { ->(h) {
    ->(i) { -> (j) {
      λ[
        d[
          d[
            w[i]][
            w[j]
          ]][
          y[i][j]
        ]
      ][
        -> {
          m[
            h[
              w[i][
                υ[c][e][m]][
                i
              ]
            ][
              ->(λ) {
                ->(c) {
                  o[
                    c][
                    m[λ][
                      ξ[и[b][c]]][
                      f
                    ]
                  ]
                }[
                  o[
                    й[c][e][n][n[n[λ]]]][
                    й[c][e][m][m[n[λ]]]
                  ]
                ]
              }][
              o[c][g]
            ]
          ]
        }][
        -> { f }
      ]
    } }[
      υ[c][e][n]][
      υ[c][e][m]
    ]
  }}}}
]



}[
  # "chλnge_func"
  # "й"
  ->(λ) { ->(b) { ->(c) {
    ->(d) { ->(e) {
      x[d][e][
        y[d][e][
          ->(f) { f }][
          u
        ]][
        t
      ]
    } }[
      c[λ]][
      c[b]
    ]
  }}}
]



}[
  # "get_position"
  # "и"
  ->(λ) { ->(b) {
    θ[θ[λ][m[b]]][n[b]]
  }}
]

}[
  # "sλme_position"
  # "з"
  ->(λ) {
    ->(b) {
      e[
        y[n[λ]][n[b]]][
        y[m[λ]][m[b]]
      ]
    }}
]

}[
  # "boλrd_reduce"
  # "ж"
  ->(λ) { ->(b) { ->(c) {
    π[
      λ][
      α][
      ->(d) { ->(e) { ->(f) {
        π[
          e][
          α][
          ->(d) { ->(g) { ->(h) {
            b[d][g][o[h][f]]
          }}}][
          d
        ]
      }}}][
      c
    ]
  }}}
]

}[
  # "with_bλsic_info"
  # "е"
  ->(λ) { ->(b) { b[а[λ]][ψ[λ]][ω[λ]] } }
]

}[
  # "creλte_stλte"
  # "д"
  ->(λ) { ->(b) { ->(c) { ->(d) { ->(e) { ->(f) { ->(g) {
    o[
      o[
        o[λ][b]][
        o[e][f]
      ]][
      o[
        g][
        o[c][d]
      ]
    ]
  }}}}}}}
]

}[
  # "get_score"
  # "г"
  ->(λ) { δ[n[λ]] }
]


}[
  # "get_promotion"
  # "в"
  ->(λ) { n[m[λ]] }
]

}[
  # "get_lλst_from"
  # "б"
  ->(λ) { n[δ[λ]] }
]

}[
  # "get_boλrd"
  # "а"
  ->(λ) { ε[n[λ]] }
]

}[
  # "get_to"
  # "ω"
  ->(λ) { m[η[λ]] }
]

}[
  # "get_from"
  # "ψ"
  ->(λ) { n[η[λ]] }
]

}[
  # "get_lλst_to"
  # "χ"
  ->(λ) { m[δ[λ]] }
]

}[
  # "empty_spλce"
  # "φ"
  o[o[g][l]][o[f][f]]
]

}[
  # "deltλ"
  # "υ"
  ->(λ) { ->(b) { ->(c) {
    ->(λ) {
    ->(b) {
      x[λ][b][
        v[λ][b]][
        v[b][λ]
      ]
    }}[
      c[λ]][
      c[b]
    ]
  }}}
]

}[
  # "vector_reduce"
  # "τ"
  ->(λ) { ->(b) { ->(c) {
    π[
      n[λ]][
      m[λ]][
      ->(d) { ->(e) { ->(_) { b[d][e] }}}][
      c
    ]
  }}}
]

}[
  # "vector_first"
  # "σ"
  ->(λ) { θ[n[λ]][l] }
]

}[
  # "vector_λppend"
  # "ς"
  ->(λ) { ->(b) {
    o[
      o[b][n[λ]]][
      t[m[λ]]
    ]
  }}
]

}[
  # "empty_vector"
  # "ρ"
  o[l][l]
]

}[
  # "list_reduce"
  # "π"
  ->(λ) { ->(b) { ->(c) { ->(d) {
    n[
      b[
        ->(e) {
          o[
            c[
              n[e]][
              θ[λ][m[e]]][
              m[e]
            ]][
            t[m[e]]
          ]
        }][
        o[d][l]
      ]
    ]
  }}}}
]

}[
  # "list_mλp"
  # "ο"
  ->(λ) { ->(b) { ->(c) {
    n[
      b[
        ->(d) {
          o[
           o[
             c[
               θ[λ][m[d]]][
               m[d]
             ]][
             n[d]
            ]][
            u[m[d]]
          ]
        }][
        o[l][u[b]]
      ]
    ]
  }}}
]




}[
  # "is_empty"
  # "ξ"
  ->(λ) {
    c[ε[λ]]
  }
]

}[
  # "is_blλck"
  # "ν"
  ->(λ) {
    κ[λ][g][f][f]
  }
]

}[
  # "is_white"
  # "μ"
  ->(λ) {
    κ[λ][f][g][f]
  }
]

}[
  # "color_switch"
  # "κ"
  ->(λ) {
    ->(b) { ->(c) { ->(d) {
      ε[λ][
        η[λ][
          b][
          c
        ]][
        d
      ]
    }}}
  }
]

}[
  # "hλs_vλlue"
  # "ι"
  ->(λ) {
  ->(b) {
    y[b][ ζ[λ]]
  }}
]




}[
  # "nth"
  # "θ"
  ->(λ) { ->(b) { n[b[m][λ]] } }
]

}[
  # "get_color"
  # "η"
  ->(λ) { n[n[λ]] }
]


}[
  # "get_vλlue"
  # "ζ"
  ->(λ) { m[n[λ]] }
]


}[
  # "get_occupied"
  # "ε"
  ->(λ) { n[m[λ]] }
]


}[
  # "δ"
  ->(λ) { m[m[λ]] }
]

}[
  # "six"
  # "γ"
  z[j][i]
]

}[
  # "seven"
  # "β"
  p[i][h]
]

}[
  # "eight"
  # "α"
  z[j][h]
]

}[
  # "multiply"
  # "z"
  ->(λ) {->(b) {
    ->(c) { ->(d) {
      λ[
        ->(w) { b[c][w] }][
        d
      ]
    }}
  }}
]


}[
  # "is_equλl"
  # "y"
  ->(b) {
  ->(c) {
    λ[x[b][c]][
      -> { x[c][b] }][
      -> { f }
    ]
  }
  }
]


}[
  # "is_greλter_or_equλl"
  # "x"
  ->(λ) {
  ->(b) {
    w[v[b][λ]]
  }
  }
]


}[
  # "is_zero"
  # "w"
  ->(λ) {
    λ[->(_) { f }][g]
  }
]


}[
  # "subtrλct"
  # "v"
  ->(λ) { ->(b) {
    ->(c) { ->(d) {
      b[u][λ][c][d]
    }}
  }}
]

}[
  # "decrement"
  # "u"
  ->(λ) {
    m[
      λ[
        ->(b) {
          o[
            t[n[b]]][
            n[b]
          ]
        }][
        o[l][l]
      ]
    ]
  }
]

}[
  # "increment"
  # "t"
  ->(λ) { p[k][λ] }
]

}[
  # "blλck_queen"
  # "s"
  o[o[g][q]][o[g][g]]
]

}[
  # "white_queen"
  # "r"
  o[o[f][q]][o[g][g]]
]

}[
  # "five"
  # "q"
  p[j][i]
]

}[
  # "λdd"
  # "p"
  ->(λ) { ->(b) {
    ->(c) { ->(d) {
      b[c][λ[c][d]]
    }
  } } }
]

}[
  # "pλir"
  # "o"
  ->(λ) {
    ->(b) {
      ->(c) { c[λ][b] }
    }}
]

}[
  # "left"
  # "n"
  ->(λ) { λ[g]  }
]

}[
  # "right"
  # "m"
  ->(λ) { λ[f] }
]

}[
  # "zero"
  # "l"
  ->(λ) { ->(b) { b } }
]

}[
  # "one"
  # "k"
  ->(λ) { ->(b) { λ[b] } }
]

}[
  # "two"
  # "j"
  ->(λ) { ->(b) { λ[λ[b]] } }
]

}[
  # "three"
  # "i"
  ->(λ) { ->(b) { λ[λ[λ[b]]] } }
]

}[
  # "four"
  # "h"
  ->(λ) { ->(b) { λ[λ[λ[λ[b]]]] } }
]

}[
  # "first"
  # "g"
  ->(λ) {
  ->(_) { λ } }
]

}[
  # "second"
  # "f"
  ->(_) {
  ->(λ) { λ } }
]

}[
  # "λnd"
  # "e"
  ->(λ) {
  ->(b) {
    ->(c) {
    ->(d) {
      λ[b[c][d]][d]
    }
  }
  }
  }
]

}[
  # "or"
  # "d"
  ->(λ) {
  ->(b) {
    ->(c) {
    ->(d) {
      λ[c][b[c][d]]
    }
  }
  }
  }
]

}[
  # "not"
  # "c"
  ->(λ) {
    ->(b){
        ->(c) {
          λ[c][b]
        }
      }}
]

}[
  # "five_conditions_met"
  # "b"
  ->(λ) {
  ->(b) {
  ->(c) {
  ->(d) {
  ->(e) {
    ->(f) {
    ->(g) {
      λ[b[c[d[e[
        f][
        g]][
        g]][
        g]][
        g]][
        g]
    }
  }}}}}}
]

}[
  # "if"
  # "λ"
  ->(λ) {
    ->(b) {
    ->(c) {
      λ[b][c][]
    }
  }}
]
